# Pandas
### Python Pandas: Tips & Tricks

### #7: Menghapus Missing Values pada Pandas Data Frame

### Importing Modules

In [4]:
import pandas as pd
import numpy as np

### Persiapan Data Frame

In [20]:
df = pd.DataFrame({'Z': ['098uio', 'hjk876', '987bhy', '457gbv', '986tgh', '098uio', 'hjk876', '987bhy', '457gbv', '986tgh'],
                   'A': [-1.48767, np.nan, 0.42679, np.nan, -1.03785, 1.28765, -1.48765, -1.39876, 0.86543, -0.07654],
                   'B': [-0.28765, np.nan, 1.07634, 1.69873, -0.68543, 1.28765, -1.48765, -1.39876, 0.86543, -0.07654],
                   'C': [1.28765, -1.48765, -1.39876, 0.86543, -0.07654, 1.28765, -1.48765, -1.39876, 0.86543, -0.07654],
                   'D': [-1.57890, -0.97654, 0.026789, np.nan, 0.19999, 1.28765, -1.48765, -1.39876, 0.86543, -0.07654]})
df.head()

        Z        A        B        C         D
0  098uio -1.48767 -0.28765  1.28765 -1.578900
1  hjk876      NaN      NaN -1.48765 -0.976540
2  987bhy  0.42679  1.07634 -1.39876  0.026789
3  457gbv      NaN  1.69873  0.86543       NaN
4  986tgh -1.03785 -0.68543 -0.07654  0.199990

In [21]:
df_backup = df.copy(deep=True)

### Menghapus (drop) setiap kolom yang mengandung missing values

In [22]:
df = df.dropna(axis='columns')
df

        Z        C
0  098uio  1.28765
1  hjk876 -1.48765
2  987bhy -1.39876
3  457gbv  0.86543
4  986tgh -0.07654
5  098uio  1.28765
6  hjk876 -1.48765
7  987bhy -1.39876
8  457gbv  0.86543
9  986tgh -0.07654

### Menghapus (drop) setiap baris yang mengandung missing values

In [23]:
# mengembalikan kondisi data frame dari salinan
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df

        Z        A        B        C         D
0  098uio -1.48767 -0.28765  1.28765 -1.578900
2  987bhy  0.42679  1.07634 -1.39876  0.026789
4  986tgh -1.03785 -0.68543 -0.07654  0.199990
5  098uio  1.28765  1.28765  1.28765  1.287650
6  hjk876 -1.48765 -1.48765 -1.48765 -1.487650
7  987bhy -1.39876 -1.39876 -1.39876 -1.398760
8  457gbv  0.86543  0.86543  0.86543  0.865430
9  986tgh -0.07654 -0.07654 -0.07654 -0.076540

### Persentase missing values untuk tiap kolom

In [24]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.0
A    0.2
B    0.1
C    0.0
D    0.1
dtype: float64

### Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold (ambang) tertentu

In [25]:
threshold = len(df) * 0.9
df = df.dropna(thresh=threshold, axis='columns')
df

        Z        B        C         D
0  098uio -0.28765  1.28765 -1.578900
1  hjk876      NaN -1.48765 -0.976540
2  987bhy  1.07634 -1.39876  0.026789
3  457gbv  1.69873  0.86543       NaN
4  986tgh -0.68543 -0.07654  0.199990
5  098uio  1.28765  1.28765  1.287650
6  hjk876 -1.48765 -1.48765 -1.487650
7  987bhy -1.39876 -1.39876 -1.398760
8  457gbv  0.86543  0.86543  0.865430
9  986tgh -0.07654 -0.07654 -0.076540